import React from "react";

const Terms = () => {
  return (
    `회원가입 개인정보 수집 및 이용 동의 약관

    1. 수집하는 개인정보
    
    (1) Swing은 최초 회원 가입시 서비스 제공을 위해 아래와 같은 최소한의 개인정보를 필수항목으로 수집하고 있습니다.
    
        필수항목 : 이메일 주소, 아이디, 닉네임, 비밀번호
    
    (2) 서비스 이용 과정에서 아래와 같은 정보들이 추가로 수집될 수 있습니다.
    
        서비스 이용 정보 : 사용자 정보 (이메일 주소), IP 주소, 쿠키, 방문 일시, 서비스 이용 기록, 브라우저 정보, 운영체제 정보(OS), 사용 기기 정보, MAC 주소 등
     
    2. 개인정보의 수집 및 이용목적
    
    (1) 회원관리
    
    회원제 서비스 제공, 개인식별, 서비스의 원활한 운영에 지장을 미치는 행위, 가입의사 확인, 가입 및 가입횟수 제한 등
     
    3. 개인정보의 보유 및 이용기간
    
    사용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 Swing은 관계법령에서 정한 일정한 기간 동안 회원 정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.
    
    (1) 웹사이트 방문기록
    
        보존 이유 : 통신비밀보호법
        보존 기간 : 3개월
        
    `
  );
};

export default Terms;